In [1]:
import pandas as pd
import numpy as np
import sidetable
from sklearn.impute import SimpleImputer
from sklearn.impute import KNNImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

In [2]:
df=pd.read_csv('../EDA/datos/attack_limpieza3.csv', index_col=0)
df.sample(2)

,case_number,year,type,country,activity,age,time,species_,mes,fatal_,sex2,cleaned_species
5460,1916.07.12.c,1916,Unprovoked,usa,Swimming,27,NaN,Said to involve a 2.7 m [9'] shark,Jul,n,M,Undefined
1884,2003.11.06.b,2003,Unprovoked,egypt,Snorkeling,27,NaN,2.5 oceanic whitetip shark,Nov,n,M,White

## Limpieza V - Valores Nulos Sklearn

Es el momento de ponernos a trabajar con los valores nulos de nuevo üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos de skelarn intentemos aplicarlos todos. Manos a la obra!

- EJERCICIO 1: Es el momento de eliminar los nulos:

> Reemplazad los valores nulos de la columna age por la media de la edad usando el m√©todo SimpleImputer.

In [3]:
#Iniciamos el m√©todo a realizar
imputer=SimpleImputer(strategy="mean", missing_values=np.nan)

#Vamos a ejecutar la instacia en la columna que queremos limpiar
imputer=imputer.fit(df[["age"]])

#vamos a transformar nuestro DataFrame
df["age"]=imputer.transform(df[["age"]])

> Reemplazad los valores nulos de la columna sex por la moda, usando el m√©todo SimpleImputer. üí° Pista üí° La moda en este tipo de aproximaci√≥n se indica como most_frequent.

In [4]:
#Iniciamos el m√©todo a realizar
imputer=SimpleImputer(strategy="most_frequent", missing_values=np.nan)

#Vamos a ejecutar la instacia en la columna que queremos limpiar
imputer=imputer.fit(df[["sex2"]])

#vamos a transformar nuestro DataFrame
df["sex2"]=imputer.transform(df[["sex2"]])

> Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda) con el m√©todo SimpleImputer.

In [5]:
#Iniciamos el m√©todo a realizar
imputer=SimpleImputer(strategy="most_frequent", missing_values=np.nan)

#Vamos a ejecutar la instacia en la columna que queremos limpiar
imputer=imputer.fit(df[["type"]])

#vamos a transformar nuestro DataFrame
df["type"]=imputer.transform(df[["type"]])

> Utilizad el m√©todo KNN Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

In [6]:
df_knn=df.copy()
numericas=df_knn.select_dtypes(include="number")
numericas.head(5)

   year   age
0  1976  27.0
1  1976  27.0
2  1976  27.0
3  1976  27.0
4  1976  27.0

In [7]:
#Iniciamos el KNNImputer
imputerKNN=KNNImputer(n_neighbors=5)
imputerKNN.fit(numericas)

#aplicamos el m√©todo
numericas_knn=imputerKNN.transform(numericas)

#lo convertimos a un datafraame

df_num_knn=pd.DataFrame(numericas_knn, columns=numericas.columns)

# sacamos el nombre de nuestras columnaas
columnas_knn=df_num_knn.columns

#Eliminamos las columnas
df_knn.drop(columnas_knn, axis=1, inplace=True)

#creamos las nuevas columnas a las que le aplicamos el m√©todo knn
df_knn[columnas_knn]=numericas_knn

In [8]:
df_knn.head()

,case_number,type,country,activity,time,species_,mes,fatal_,sex2,cleaned_species,year,age
0,1800.00.00,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NAN,NaN,y,F,Undefined,1976.0,27.0
1,1797.05.28.R,Unprovoked,NaN,Dropped overboard,NaN,NAN,May,y,M,Undefined,1976.0,27.0
2,1792.09.12,Provoked,england,Fishing,NaN,NAN,Sep,y,M,Undefined,1976.0,27.0
3,1791.00.00,Unprovoked,australia,NaN,NaN,NAN,NaN,y,F,Undefined,1976.0,27.0
4,1788.05.10,Boat,australia,Fishing,NaN,NAN,May,n,M,Undefined,1976.0,27.0

In [9]:
df_knn.isnull().sum()

case_number           1
type                  0
country              50
activity            544
time               3363
species_              0
mes                 576
fatal_              618
sex2                  0
cleaned_species       0
year                  0
age                   0
dtype: int64

> Utilizad el m√©todo Iterative Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

In [10]:
df_iterative=df.copy()
numericas_ite=df.select_dtypes(include= np.number)

In [11]:
#Creamos la instancia
imputer=IterativeImputer(n_nearest_features=None, imputation_order="ascending")

#Lo aplicamos sobre nuestras variables
imputer.fit(numericas_ite)

#transformamos nuestros datos
imputer.transform(numericas_ite)

#Convertimos el array en dataframe
numericas_trans=pd.DataFrame(imputer.transform(numericas_ite), columns=numericas_ite.columns)

#Sacamos el nombre de las columnas
columnas_ite=numericas_trans.columns

#eliminamos las columnas
df_iterative.drop(columnas_ite, axis=1, inplace= True)

df_iterative[columnas_ite]=numericas_trans[columnas_ite]

> ¬øPodr√≠ais explicar qu√© diferencia hay entre estos dos √∫ltimos m√©todos?

No se puede apreciar un cambio como tal ya que las columnas n√∫mericas que tenemos no tienen nulos desde un principio, pero a√∫n as√≠ se puede ver que usar un m√©todo o el otro es lo mismo ya que son los mismos pasos.

- EJERCICIO 2: Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair

In [12]:
df.to_csv("../EDA/datos/attack_limpieza5.csv")